# config.py

import os
from dotenv import load_dotenv

# 加载环境变量
load_dotenv()

# API配置
API_CONFIG = {
    'deepseek': {
        'base_url': "https://api.deepseek.com/v1",
        'default_model': "deepseek-chat"
    },
    # 'openai': {
    #     'base_url': "http://118.195.161.49:27984/v1",
    #     'default_model': "qwen-local"
    # }
    'openai': {
        'base_url': "https://dashscope.aliyuncs.com/compatible-mode/v1",
        'default_model': "qwen-plus-latest"
    }
}

# Neo4j配置
NEO4J_CONFIG = {
    'url': "neo4j://localhost:7687",
    'username': "neo4j",
    'password': os.getenv('NEO4J_PASSWORD', 'test_pass')
}

# 本地嵌入配置
EMBEDDING_CONFIG = {
    'local': {
        'base_url': "http://127.0.0.1:5000/v1",
        'model': "e5-large"
    }
}

# stra = "asda" + "ads"

system_prompt_str = "实体类型定义：" +  \
        "- 民事主体类：自然人，法人，非法人组织等" + \
        "- 权利类：民事主体依法享有的利益支配权 ，包括人身权、财产权、知识产权等" + \
        "- 义务类：民事主体的民事义务或民事责任等" +    \
        "- 法律行为：民事主体通过意思表示设立、变更、终止民事法律关系的行为。" +    \
        "- 法律活动/程序：民事主体参与的、受法律规范调整的具体行为过程 ，包括法律行为的实施与后果。" +  \
        "- 法律制度类：民法典中系统规范某一类法律关系的结构性规则体系 " +   \
        "- 法律关系客体类：物，不动产（土地、房屋等），动产（动产、货币、有价证券等）权利法律规定的权利作为物权客体（如地役权）行为合法行为（如合同履行）非法行为（如侵权行为）智力成果与标识作品、发明、商标、地理标志等" +    \
        "\n特殊要求：" +    \
        " 重要：***当一个主体同时和其他多个并列的主体有关系时，应当提取出多个关系" +    \
        " 抽取出的关系数量无限制，请尽量详尽的抽取出所有可能的关系"
        # " 尽量不要生成过长的句子，主体，关系应当是简短的词语",+   \    
        # " 提取出的关系应当满足： (主体a) + 关系xxx + (主体b)  是一句有意义的话",
        # " 所提取出来的关系都有意义",
        # "  生成不超过20条关系",
        # "关系模式示例：" + schema_examples if schema_examples else "",

system_summary_rela_str = "您是民法典知识图谱架构师，请严格遵循以下规则归纳关系类型：" +    \
        "【核心规则】"+ \
        "1. 抽象层级：提炼法律关系本质"+    \
        "2. 关系类型必须是 动词短语（≤6字）"+   \
        "3. 关系类型中禁止包含任何具体权利/义务或关系客体，即"+ \
        " 禁止生成：'享有名誉权' '承担违约责任' '设立抵押权'"+  \
        " 应该生成：'享有' '承担' '设立'"+  \
        "4. 可以合并相似法律行为"+  \
        "5. 忽略时间/数量等修饰词"

SIMILARITY_THRESHOLD:float = 0.98

# 图谱配置 #TODO 这些节点和边不对。应该按法条的内容重新写
GRAPH_CONFIG = {
    # 'allowed_nodes': [
    #     "民事主体","法律行为","民事客体","民事义务","法人",
    #     "自然人","民事权利","法定要求","法律负责","法定期间",
    #     "非法人组织","法律事实","法律效果"
    # ]
    'allowed_nodes':
    [
        # "自然人",
        # "法人",
        # "非法人组织",
        "民事主体类"
        "权利类",
        "义务类",
        "法律行为",
        "法律活动/程序",
        "法律制度类",
        "法律关系客体类",
        "法律效力类"
    ],
    'allowed_relationships': []
    #     "主体与法律行为关系","行为能力关系","身份确认关系",
    #     "权力主体关系","权利保护关系","主体与主体关系","临时监护关系",
    #     "授权与代理关系","行为与责任关系","责任承担关系","权利限制关系",
    #     "能力与代理关系","权利主体与客体关系","权利主体与权力关系",
    #     "权利内容关系","财产与捐助关系","紧急救助关系","给付关系",
    #     "类型与主体关系","指定关系","授权与代理关系","财产管理关系",
    #     "协议关系","义务约束关系","组织与监护关系","主体与法律行为关系",
    #     "权利能力关系","监护关系","合法性确认关系","利益关系","责任落实关系",
    #     "查询权利","赔偿关系","管理关系","监督关系","经营与责任关系",
    #     "伦理规范与法律效果关系","权益与客体关系","法院与个体关系",
    #     "资格丧失关系","实践与法律行为关系","临时保护关系","能力与角色关系",
    #     "合规性关系","权利时间关系","职责与义务关系","请求与补偿关系","抚养关系",
    #     "义务履行关系","保护责任","权利实现关系","职责关系","权利义务转移关系",
    #     "全力实现关系","法律确认关系","活动资格","代表与责任","亲属关系",
    #     "指派关系","请求与执行关系","法律考量关系","财产关系","终止关系",
    #     "通知与行为关系","客体与属性关系","条件与法律效果关系",
    #     "优先受偿关系","占有与妨害关系","合同内含关系","履行义务关系",
    #     "民事权利能力时间关系","法人登记关系",
    #     "物权设立/变更/转让/消灭关系","共有关系","担保物权关系",
    #     "合同成立关系","合同履行关系","合同解除关系","违约责任关系",
    #     "格式条款效力关系","隐私权保护关系","个人信息处理关系",
    #     "人格权商业化利用关系","错责任/无过错责任适用关系",
    #     "产品责任追偿关系","法律原则关系","不动产登记属地关系"
    # ]
}
# DYNAMIC_CONFIG = {
#     'relation_cache_file': 'dynamic_relations.json'
# }

# 文档处理配置 #TODO 结合你的分块算法
DOC_CONFIG = {
    'chunk_size': 2000,
    'chunk_overlap': 40
}

ITEM_NUM = 10



# 应用配置
APP_CONFIG = {
    'title': "DataGraphX：实时图谱RAG应用",
    'description': """
    此应用程序允许您上传PDF文件，将其内容提取到Neo4j图形数据库中，并使用自然语言执行查询。
    它利用LangChain和DeepSeek的模型生成Cypher查询，实时与Neo4j数据库交互。
    """,
    'logo_path': 'logo.png'
}
